# Merging products.csv and orders.csv via df_ords_prior

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Project folder path as string
path = r'/Users/sophie/Desktop/CareerFoundry /09 2023 Phython'
path

'/Users/sophie/Desktop/CareerFoundry /09 2023 Phython'

In [19]:
# Importing data sets 
df_ords_prior = pd.read_csv(os.path.join(path, 'Data', 'original data ', 'orders_products_prior.csv'), index_col = False)
df_ords = pd.read_csv(os.path.join(path, 'Data', 'prepared data ', 'orders_checked.csv'), index_col = False)

In [20]:
# Check output
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [21]:
df_ords.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer
0,0,2539329,1,prior,1,2,8,NaN,True
1,1,2398795,1,prior,2,3,7,15.0,False
2,2,473747,1,prior,3,3,12,21.0,False
3,3,2254736,1,prior,4,4,7,29.0,False
4,4,431534,1,prior,5,4,15,28.0,False

In [22]:
df_ords_new = df_ords.drop(columns = ['Unnamed: 0', 'eval_set'])
df_ords_new.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

In [23]:
df_ords_prior.shape

(32434489, 4)

In [24]:
df_ords_new.shape

(3421083, 7)

In [25]:
# Full join
df_merged_large = df_ords_new.merge(df_ords_prior, on = 'order_id', indicator = True)

In [26]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [28]:
df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

In [27]:
df_merged_large[['order_id', 'user_id', 'order_number']].dtypes

order_id        int64
user_id         int64
order_number    int64
dtype: object

# Exporting in pkl format

In [30]:
# Export data to csv

#df_merged_large.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.csv'))

# Export data to pkl

df_merged_large.to_pickle(os.path.join(path, 'Data', 'prepared data ', 'orders_products_combined.pkl'))
df_merged_large.shape

(32434489, 11)